{
  "_class_name": "FlowMatchEulerDiscreteScheduler",
  "_diffusers_version": "0.38.0.dev0",
  "base_image_seq_len": 256,
  "base_shift": 0.5,
  "beta_end": 0.02,
  "beta_schedule": "linear",
  "beta_start": 0.0001,
  "disable_corrector": [],
  "dynamic_thresholding_ratio": 0.995,
  "final_sigmas_type": "zero",
  "flow_shift": 3.0,
  "invert_sigmas": false,
  "lower_order_final": true,
  "max_image_seq_len": 4096,
  "max_shift": 1.15,
  "num_train_timesteps": 1000,
  "predict_x0": true,
  "prediction_type": "flow_prediction",
  "rescale_betas_zero_snr": false,
  "sample_max_value": 1.0,
  "shift": 1.0,
  "shift_terminal": null,
  "sigma_max": null,
  "sigma_min": null,
  "solver_order": 2,
  "solver_p": null,
  "solver_type": "bh2",
  "steps_offset": 0,
  "stochastic_sampling": false,
  "thresholding": false,
  "time_shift_type": "exponential",
  "timestep_spacing": "linspace",
  "trained_betas": null,
  "use_beta_sigmas": false,
  "use_dynamic_shifting": false,
  "use_exponential_sigmas": false,
  "use_flow_sigmas": true,
  "use_karras_sigmas": false
}
